app/controllers/recursos_controller.rb

  def envia_ciencia
    @evento = Evento.find(params[:evento_id])
    @evento.recursos_eventos.build
    @recurso_alocado = RecursoAlocado.new
    @materiais = RecursoEvento.materiais - @evento.recursos_eventos
    @materiais = @materiais.collect{|m| ["#{m.nome} (#{m.setor_responsavel.nome}) ", m.id]}
    @recursos_convocacoes = RecursoEvento.convocacoes
    @recursos_ciencias = RecursoEvento.ciencias
    responsavel = Pessoa.find(@evento.created_by).nome
---
SELECT * FROM [agenda_recursos_eventos] WHERE (tipo = 'material' AND quantidade > 0) ORDER BY nome
SELECT * FROM [agenda_recursos_eventos] WHERE ([agenda_recursos_eventos].[id] = 32) ORDER BY nome
SELECT TOP 1 * FROM [pessoas] WHERE ([pessoas].[id] = 1)